In [3]:
import pandas as pd
import numpy as np

Сегодня изучил способы отбора наблюдений в пандасе, основные сходства и различия, попробовал комбинации различных методов пандаса, что бы решать типичные аналитческие задачи..

* Для примера взял данные:
* о четырех студентах 
* состоящие в дыух групах
* и балы в трех предметах 

df.loc - обращаемся к нашем наблюдениям (строкам и калонкам) по лейблу (названию) 

df.iloc - обращаемся к нашем наблюдениям (строкам и калонкам) , отбор наблюдений по тндексу, аналогисчно списку

In [15]:
df = pd.DataFrame(
    {'value_1' : [1.2, 1.2, 3.7, 5.6],
    'value_2' : [1.2, 1.2, 3.7, 5.6],
    'value_3' : [1.2, 1.2, 3.2, np.nan],
    'group' : ['A', 'A', 'B', 'B']}
)
df.index = ['student_1', 'student_2', 'student_3', 'student_4']

In [16]:
df

           value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_2      1.2      1.2      1.2     A
student_3      3.7      3.7      3.2     B
student_4      5.6      5.6      NaN     B

In [17]:
df.loc['student_1', 'value_1']

1.2

In [42]:
df.iloc[0, 0]

1.2

In [43]:
df.loc['student_1', :]

value_1    1.2
value_2    1.2
value_3    1.2
group        A
Name: student_1, dtype: object

In [44]:
df.iloc[0, :]

value_1    1.2
value_2    1.2
value_3    1.2
group        A
Name: student_1, dtype: object

In [45]:
df.loc[['student_1','student_4'], :]

           value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_4      5.6      5.6      NaN     B

In [46]:
df.loc[['student_1','student_4'], ['value_1', 'group']]

           value_1 group
student_1      1.2     A
student_4      5.6     B

 мы можем получать дата фрейм или пандовсовскую серию , если пмещаем в список => датафрейм, если без списка серия ,  в зависимости от задачи

In [63]:
df.loc[['student_1','student_2','student_3'], ['value_2','group']]

           value_2 group
student_1      1.2     A
student_2      1.2     A
student_3      3.7     B

In [52]:
df.iloc[[0, 1, 2,], [0, -1]]

           value_1 group
student_1      1.2     A
student_2      1.2     A
student_3      3.7     B

In [64]:
df.iloc[[0, 1, 2], :]

           value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_2      1.2      1.2      1.2     A
student_3      3.7      3.7      3.2     B

In [68]:
df.loc[['student_1','student_2','student_3'], :]

           value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_2      1.2      1.2      1.2     A
student_3      3.7      3.7      3.2     B

In [70]:
df.value_3 > 3

student_1    False
student_2    False
student_3     True
student_4    False
Name: value_3, dtype: bool

In [74]:
df.loc[df.value_3 > 3, :]

           value_1  value_2  value_3 group
student_3      3.7      3.7      3.2     B

In [77]:
df[df.value_3 > 3]

           value_1  value_2  value_3 group
student_3      3.7      3.7      3.2     B

In [78]:
df.duplicated()

student_1    False
student_2     True
student_3    False
student_4    False
dtype: bool

In [6]:
df[df.duplicated()]

           value_1  value_2  value_3 group
student_2      1.2      1.2      1.2     A

In [45]:
df.query('value_1 > 2')

           value_1  value_2  value_3 group
student_3      3.7      3.7      3.2     B
student_4      5.6      5.6      NaN     B

In [55]:
'''Бывает необходимо найти ячейки в которых отсутствую данные, это можно выполнить различными способами'''

'Бывает необходимо найти ячейки в которых отсутствую данные, это можно выполнить различными способами'

In [57]:
 ### ISNULL ()   NOTNULL ()

In [31]:
pd.notnull(df)

           value_1  value_2  value_3  group
student_1     True     True     True   True
student_2     True     True     True   True
student_3     True     True     True   True
student_4     True     True    False   True

In [44]:
df.notnull

<bound method DataFrame.notnull of            value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_2      1.2      1.2      1.2     A
student_3      3.7      3.7      3.2     B
student_4      5.6      5.6      NaN     B>

In [53]:
df[pd.isnull(df["value_3"])]

           value_1  value_2  value_3 group
student_4      5.6      5.6      NaN     B

In [54]:
df[pd.notnull(df["value_3"])]

           value_1  value_2  value_3 group
student_1      1.2      1.2      1.2     A
student_2      1.2      1.2      1.2     A
student_3      3.7      3.7      3.2     B